---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalConductivity
source: html/c30bad03-44b5-1cd5-5f13-7256ccc91b16.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalConductivity Property

The thermal conductivity of the material.

## Syntax (C#)
```csharp
public double ThermalConductivity { get; }
```